import 'package:flutter/material.dart';

class DetailSection extends StatelessWidget {
  const DetailSection({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Expanded(
        child: Container(
            padding: EdgeInsets.all(10),
            child: Text(
                '           ภาษาไพธอน (Python) เป็นภาษาการเขียนโปรแกรมระดับสูง ที่นำข้อดีของภาษา'
                'ต่างๆ มารวมไว้ด้วยกัน ถูกออกแบบมาให้เรียนรู้ได้ง่าย และมีไวยากรณ์ที่ช่วยให้เขียน'
                'โค้ดสั้นกว่าภาษาอื่นๆ มีความสามารถใช้ชนิดข้อมูลแบบไดนามิก จัดการหน่วยความจำ'
                'อัตโนมัติ สนับสนุนกระบวนทัศน์การเขียนโปรแกรม (Programming paradigms)'
                'ประกอบด้วย การเขียนโปรแกรมเชิงวัตถุ (OOP : Object Oriented Programming) การ'
                'เขียนโปรแกรมเชิงคำสั่ง (Imperative Programming) การเขียนโปรแกรมเชิงฟังก์ชั่น (Functional)'
                'และการเขียนโปรแกรมเชิงกระบวนการ มีลักษณะเป็นภาษาสคริปต์ที่ทำงานร่วมกับภาษา'
                'อื่นได้ มีไลบรารี่มาตรฐานมากมาย และใช้อินเตอร์พรีเตอร์แปลภาษาโปรแกรมให้ทำงาน'
                'บนระบบปฎิบัติการได้หลากหลาย ทั้งบน Windows, MAC, Linux และ Unix นอกจาก'
                'นั้นยังเป็นโปรแกรมแบบ Oepn source ที่นำใช้ได้ฟรี เหมาะสำหรับโปรแกรมทั้งขนาด'
                'เล็กแบะขนาดใหญ่ เช่น การสร้างเกม เฟรมเวิร์กพัฒนาเว็บ โปรแกรมที่ใช้กราฟิกติดต่อ'
                'กับผู้ใช้งาน (GUI) งานคำนวนทางวิทยาศาสตร์และสถิติ งานพัฒนาซอฟแวร์ และ ซอฟแวร์ควบคุมระบบ เป็นต้น'
                , style:TextStyle(height: 1.5, fontSize: 13),
            )));
  }
}
